---
kind: property
id: P:Autodesk.Revit.DB.RoutingPreferenceRule.NumberOfCriteria
source: html/13ba24cf-2d49-8074-ee2c-26292f0827a4.htm
---
# Autodesk.Revit.DB.RoutingPreferenceRule.NumberOfCriteria Property

Gets the number of routing criteria.

## Syntax (C#)
```csharp
public int NumberOfCriteria { get; }
```